sdaiIsSubtypeOfBN(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Determines whether an entity definition is a subtype of another entity definition.
\param schemaName [in] A string that contains the schema name.
\param subName    [in] A string that contains the name of the subtype to check.
\param superName  [in] A string that contains the name of the supertype.
\returns sdaiTRUE if the specified entity has a type that is a subtype of the specified supertype; otherwise, the function returns sdaiFALSE.